# Getting started with pandas

In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [3]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [4]:
%pwd

'C:\\pydev\\pydata-book-master'

## Introduction to pandas data structures

### Series

In [6]:
obj = Series([4, 7, -5, 3])
obj # 앞은 index 이지, index 정보가 없으니 자동으로 0,1,2,3 붙은 거지!!

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [11]:
type(obj.values)

numpy.ndarray

In [13]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
type(obj.index)

pandas.indexes.range.RangeIndex

In [17]:
list(obj.index)

[0, 1, 2, 3]

In [19]:
np.array(obj.index)

array([0, 1, 2, 3], dtype=int64)

In [20]:
tuple(obj.index)

(0, 1, 2, 3)

In [21]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']) # data=[4,7,-5,3] 이렇게도 쓸 수 있지.
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [23]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [24]:
list(obj2.index)

['d', 'b', 'a', 'c']

In [25]:
obj2['a']

-5

In [27]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [28]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [29]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [30]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [31]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [32]:
'b' in obj2

True

In [33]:
'e' in obj2

False

In [34]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [35]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [36]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [37]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [38]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [39]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [40]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [41]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [42]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [43]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame
테이블 생각하면 된다

In [48]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [49]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [50]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [51]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [53]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [56]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [57]:
type(frame2['state'])

pandas.core.series.Series

In [60]:
frame2.year #frame2['year]

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [61]:
frame2.ix?

In [63]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [65]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [66]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [67]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [68]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [69]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five']); val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [70]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [71]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [72]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [74]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [75]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [77]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [78]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [80]:
pdata = {'Ohio': frame3['Ohio'][:-1], #처음부터 -1 값을 제외한
         'Nevada': frame3['Nevada'][:2]}
pdata
# series의 일부로 출력되네.

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [79]:
# series를 다시 dataframe으로 합쳐 만듬!
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [81]:
frame3.index.name = 'year'; frame3.columns.name = 'state' #column은 state고 index는 year다 알려주는 거다!! 
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [82]:
frame3.values # numpy의 2차원 array(배열)가 된다.

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [83]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index objects

In [84]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index # 주로 이렇게 얻어와서 쓴다 index
index

Index(['a', 'b', 'c'], dtype='object')

In [85]:
index[1:]

Index(['b', 'c'], dtype='object')

In [86]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [91]:
index = pd.Index(np.arange(3)+10)
index

Int64Index([10, 11, 12], dtype='int64')

In [92]:
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [93]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [94]:
'Ohio' in frame3.columns

True

In [95]:
2003 in frame3.index

False

## Essential functionality

### Reindexing

In [98]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [100]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [102]:
obj.a

-5.2999999999999998

In [104]:
obj.a = 5.1
obj.a

5.0999999999999996

In [106]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a    5.1
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [107]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [113]:
obj3.reindex(range(6), method='ffill')
# index는 있는데 값이 없으면 앞의 값을 보고 채워라!!
# forward fill이다!!

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [109]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [110]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [111]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states) #column 재배열이다!!

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [114]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [116]:
frame.ix[['a', 'b', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
d    7.0   NaN         8.0

### Dropping entries from an axis

In [117]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [118]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [122]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [121]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [123]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [124]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [125]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [126]:
obj[1]

1.0

In [127]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [128]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [129]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [130]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [131]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [132]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [133]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [135]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [136]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [137]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [138]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [139]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [147]:
data[data < 5] = 0

In [141]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [142]:
data.ix['Colorado', ['two', 'three']] # colorado 데이터에서 two, three만 가져옴!

two      5
three    6
Name: Colorado, dtype: int32

In [143]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [148]:
data.ix[2] # data frame의 index 2번!!

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [145]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [146]:
data.ix[data.three > 5, :3] # data.three가 5보다 크고 열은 0,1,2 를

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

In [9]:
from pandas import *

In [10]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [11]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [12]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [13]:
s1 + s2 # 같은 index 끼리 연산한다!!

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [15]:
from IPython.core.interactiveshell import InteractiveShell

In [16]:
InteractiveShell.ast_node_interactivity = 'all'

In [17]:


df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), # list(bcd) = ['b','c','d'] 이렇게 되는거지!! 그걸 column 명으로!! 
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1
df2

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [155]:
df1 + df2 # 같은 column, index 끼리 연산한다!!

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values|

In [18]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [19]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [20]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [22]:
df1.add(df2, fill_value=0) # 결과에 대해서 0을 채우라는 것이 아니다!!

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [26]:
df1.reindex(columns=df2.columns, fill_value=0)
# column은 df2의 것을 가져다 쓰고, 
# index가 다 NaN이면 지우고? 그냥 행을 가져다 쓰는데 df1의 행을 쓰네
#, 나머지 NaN은 0을 채워준다.

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [27]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [31]:
df1.reindex(index=df1.index, columns= df2.columns, fill_value=0)
# 위와 결과가 같지!! df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [164]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [166]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [167]:
arr - arr[0] # dataframe에서 배열을 중복해서 연산해주네!!

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [168]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [169]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [170]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [173]:
series2 = Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int32

In [174]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [171]:
frame + series2
# 합을 하는데 둘중 한곳이라도 NaN이면 NaN을 return 하지!!!

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [175]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [180]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [181]:
frame - series3

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [179]:
frame.sub(series3, axis=0)
# axis=0이니 행을 기준으로 frame에서 series3를 빼준다.
# 이름에 맞춰서 쓰는것이 당연하지!! (Utah, Ohio, ...)
# dataframe과 series의 연산은 column OR index 명에 맞춰서 한다.

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

In [32]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [33]:
frame

               b         d         e
Utah   -0.273666  1.747988  1.461616
Ohio   -0.491481  0.592441 -0.484090
Texas   1.290785  1.454433  1.206103
Oregon  0.052631  0.077090 -1.076940

In [34]:
np.abs(frame)

               b         d         e
Utah    0.273666  1.747988  1.461616
Ohio    0.491481  0.592441  0.484090
Texas   1.290785  1.454433  1.206103
Oregon  0.052631  0.077090  1.076940

In [35]:
f = lambda x: x.max() - x.min()

In [36]:
frame.apply(f) #f라는 함수를 적용한다., axis=0 생략되어 있다.

b    1.782267
d    1.670899
e    2.538556
dtype: float64

In [37]:
frame.apply(f, axis=1) # 열 집합에 대한 함수 적용

Utah      2.021654
Ohio      1.083922
Texas     0.248330
Oregon    1.154030
dtype: float64

In [189]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [191]:
frame.apply(f) # 열에 대해서 적용되네!! axis=0 인거다. 열집합에 대해서 적용

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [192]:
frame.apply(f, axis=1) # 행에 대해서 적용되네, 행집합에 대해서 적용

             min       max
Utah   -0.519439  0.478943
Ohio   -0.555730  1.965781
Texas   0.092908  0.769023
Oregon -1.296221  1.246435

In [193]:
format = lambda x: '%.2f' % x
frame.applymap(format) # applymab은 모든 element에 대해서 적용한다.

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [195]:
frame['e'].map(format) #series 경우에는 applymap이 아닌 map을 사용하는 거다.

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting and ranking

In [196]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index() # index로 sorting 해라!!

a    1
b    2
c    3
d    0
dtype: int32

In [199]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [198]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [200]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [201]:
frame.sort_index(axis=1, ascending=False) # 내림차순

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [38]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [39]:
frame.sort_index(by='b')

C:\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [41]:
frame.sort_index(by=['a', 'b'])

C:\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [42]:
frame.sort_values(by="b")

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [45]:
obj = Series([4,7,-3,2])

In [46]:
obj.sort_values() # 값으로 정렬한다.

2   -3
3    2
0    4
1    7
dtype: int64

In [47]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank() # index가 0인 7은 6.5등이다!!

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [214]:
obj.rank(method='first') # 먼저 나온 것에 빠른 등수

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [215]:
obj.rank(ascending=False, method='max') # 등수 반대로

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [226]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [227]:
frame.rank(axis = 1) # 열집합의 순위 ex) 0의 데이터 0 4.3 -2.0 가지고 순위를 매김!!

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [228]:
frame.rank(axis = 0) # 행집합의 순위 ex) a의 데이터 0 1 0 1 가지고 순위 매김!!

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

### Axis indexes with duplicate values

In [48]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [49]:
obj.index.is_unique

False

In [50]:
obj['a']

a    0
a    1
dtype: int32

In [51]:
obj['c']

4

In [52]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.133772 -1.740674  0.008193
a -0.666872 -0.089533  0.051973
b -1.130710  1.266783  1.670201
b -1.135606  0.242417 -0.855769

In [54]:
df.ix['b']

          0         1         2
b -1.130710  1.266783  1.670201
b -1.135606  0.242417 -0.855769

In [56]:
df.loc['b']

          0         1         2
b -1.130710  1.266783  1.670201
b -1.135606  0.242417 -0.855769

In [57]:
df.iloc[2:4]

          0         1         2
b -1.130710  1.266783  1.670201
b -1.135606  0.242417 -0.855769

## Summarizing and computing descriptive statistics

In [58]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [59]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [60]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [62]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [63]:
df.mean(axis=1, skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [67]:
df.idxmax() # skipna 생략되어 있다.

one    b
two    d
dtype: object

In [68]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [71]:
df.describe() # R의 summary와 같네!!

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [72]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and covariance(상관계수 공분산)

In [79]:
import pandas_datareader as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GG']:
    all_data[ticker] = web.get_data_yahoo(ticker)
all_data

{'AAPL':                   Open        High         Low       Close   Adj Close  \
 Date
 2010-01-04   30.490000   30.642857   30.340000   30.572857   27.505054
 2010-01-05   30.657143   30.798571   30.464285   30.625713   27.552608
 2010-01-06   30.625713   30.747143   30.107143   30.138571   27.114347
 2010-01-07   30.250000   30.285715   29.864286   30.082857   27.064222
 2010-01-08   30.042856   30.285715   29.865715   30.282858   27.244156
 2010-01-11   30.400000   30.428572   29.778572   30.015715   27.003820
 2010-01-12   29.884285   29.967142   29.488571   29.674286   26.696650
 2010-01-13   29.695715   30.132856   29.157143   30.092857   27.073221
 2010-01-14   30.015715   30.065714   29.860001   29.918571   26.916422
 2010-01-15   30.132856   30.228571   29.410000   29.418571   26.466595
 2010-01-19   29.761429   30.741428   29.605715   30.719999   27.637430
 2010-01-20   30.701429   30.792856   29.928572   30.247143   27.212029
 2010-01-21   30.297142   30.472857   29.601429   29.724285   26.741631
 2010-01-22   29.540001   29.642857   28.165714   28.250000   25.415281
 2010-01-25   28.930000   29.242857   28.598572   29.010000   26.099028
 2010-01-26   29.421429   30.530001   28.940001   29.420000   26.467880
 2010-01-27   29.549999   30.082857   28.504286   29.697144   26.717218
 2010-01-28   29.275715   29.357143   28.385714   28.469999   25.613209
 2010-01-29   28.725714   28.885714   27.178572   27.437143   24.683992
 2010-02-01   27.481428   28.000000   27.328571   27.818571   25.027143
 2010-02-02   27.987143   28.045713   27.625713   27.980000   25.172379
 2010-02-03   27.881428   28.600000   27.774286   28.461428   25.605494
 2010-02-04   28.104286   28.338572   27.367144   27.435715   24.682707
 2010-02-05   27.518572   28.000000   27.264286   27.922857   25.120964
 2010-02-08   27.955715   28.268572   27.714285   27.731428   24.948748
 2010-02-09   28.059999   28.214285   27.821428   28.027143   25.214790
 2010-02-10   27.984285   28.085714   27.751429   27.874287   25.077271
 2010-02-11   27.840000   28.535715   27.722857   28.381428   25.533520
 2010-02-12   28.301428   28.805714   27.928572   28.625713   25.753294
 2010-02-16   28.848572   29.098572   28.788572   29.057142   26.141434
 ...                ...         ...         ...         ...         ...
 2017-07-24  150.580002  152.440002  149.899994  152.089996  151.495071
 2017-07-25  151.800003  153.839996  151.800003  152.740005  152.142548
 2017-07-26  153.350006  153.929993  153.059998  153.460007  152.859726
 2017-07-27  153.750000  153.990005  147.300003  150.559998  149.971069
 2017-07-28  149.889999  150.229996  149.190002  149.500000  148.915207
 2017-07-31  149.899994  150.330002  148.130005  148.729996  148.148224
 2017-08-01  149.100006  150.220001  148.410004  150.050003  149.463058
 2017-08-02  159.279999  159.750000  156.160004  157.139999  156.525330
 2017-08-03  157.050003  157.210007  155.020004  155.570007  154.961472
 2017-08-04  156.070007  157.399994  155.690002  156.389999  155.778259
 2017-08-07  157.059998  158.919998  156.669998  158.809998  158.188797
 2017-08-08  158.600006  161.830002  158.270004  160.080002  159.453827
 2017-08-09  159.259995  161.270004  159.110001  161.059998  160.429993
 2017-08-10  159.899994  160.000000  154.630005  155.320007  155.320007
 2017-08-11  156.600006  158.570007  156.070007  157.479996  157.479996
 2017-08-14  159.320007  160.210007  158.750000  159.850006  159.850006
 2017-08-15  160.660004  162.199997  160.139999  161.600006  161.600006
 2017-08-16  161.940002  162.509995  160.149994  160.949997  160.949997
 2017-08-17  160.520004  160.710007  157.839996  157.860001  157.860001
 2017-08-18  157.860001  159.500000  156.720001  157.500000  157.500000
 2017-08-21  157.500000  157.889999  155.110001  157.210007  157.210007
 2017-08-22  158.229996  160.000000  158.020004  159.779999  159.779999
 2017-08-23  159.070007  160.470001  158.880005  159.979996  159.979996
 2017-08-24  160.429993  160.740005  158.550003  159.270004  159.270004
 2017-08-25  159.649994  160.559998  159.270004  159.860001  159.860001
 2017-08-28  160.139999  162.000000  159.929993  161.470001  161.470001
 2017-08-29  160.100006  163.119995  160.000000  162.910004  162.910004
 2017-08-30  163.800003  163.889999  162.610001  163.350006  163.350006
 2017-08-31  163.639999  164.520004  163.479996  164.000000  164.000000
 2017-09-01  164.800003  164.940002  163.630005  164.050003  164.050003

                Volume
 Date
 2010-01-04  123432400
 2010-01-05  150476200
 2010-01-06  138040000
 2010-01-07  119282800
 2010-01-08  111902700
 2010-01-11  115557400
 2010-01-12  148614900
 2010-01-13  151473000
 2010-01-14  108223500
 2010-01-15  148516900
 2010-01-19  182501900
 2010-01-20  153038200
 2010-01-21  152038600
 2010-01-22  220441900
 2010-01-25  266424900
 2010-01-26  466777500
 2010-01-27  430642100
 2010-01-28  293375600
 2010-01-29  311488100
 2010-02-01  187469100
 2010-02-02  174585600
 2010-02-03  153832000
 2010-02-04  189413000
 2010-02-05  212576700
 2010-02-08  119567700
 2010-02-09  158221700
 2010-02-10   92590400
 2010-02-11  137586400
 2010-02-12  163867200
 2010-02-16  135934400
 ...               ...
 2017-07-24   21493200
 2017-07-25   18853900
 2017-07-26   15781000
 2017-07-27   32476300
 2017-07-28   17213700
 2017-07-31   19845900
 2017-08-01   35368600
 2017-08-02   69936800
 2017-08-03   27097300
 2017-08-04   20559900
 2017-08-07   21870300
 2017-08-08   36205900
 2017-08-09   26131500
 2017-08-10   40804300
 2017-08-11   26257100
 2017-08-14   22028200
 2017-08-15   29465500
 2017-08-16   27671600
 2017-08-17   27940600
 2017-08-18   27428100
 2017-08-21   26368500
 2017-08-22   21604600
 2017-08-23   19399100
 2017-08-24   19818900
 2017-08-25   25480100
 2017-08-28   25966000
 2017-08-29   29516900
 2017-08-30   27269600
 2017-08-31   26785100
 2017-09-01   16552800

 [1931 rows x 6 columns],
 'GG':                  Open       High        Low      Close  Adj Close    Volume
 Date
 2010-01-04  40.889999  41.130001  40.450001  40.680000  36.422840   6570500
 2010-01-05  40.980000  41.549999  40.380001  41.220001  36.906334   7682900
 2010-01-06  41.630001  42.549999  41.529999  41.959999  37.568871   9120400
 2010-01-07  41.950001  41.980000  41.209999  41.840000  37.461441   5832400
 2010-01-08  42.009998  42.459999  41.419998  42.410000  37.971786   5944300
 2010-01-11  43.189999  43.549999  42.189999  42.450001  38.007595   6548800
 2010-01-12  41.950001  42.570000  40.790001  40.930000  36.659611   9330000
 2010-01-13  41.139999  41.490002  40.340000  41.169998  36.874584   7898300
 2010-01-14  41.330002  41.480000  40.340000  40.599998  36.364044   7455200
 2010-01-15  40.320000  40.320000  39.500000  39.650002  35.513172  10712500
 2010-01-19  39.619999  40.360001  39.599998  40.310001  36.104321   6843600
 2010-01-20  39.250000  39.790001  37.840000  38.160000  34.178623  15536400
 2010-01-21  38.070000  38.400002  36.910000  36.959999  33.103817  14384200
 2010-01-22  36.779999  37.900002  36.500000  36.930000  33.076962  12340000
 2010-01-25  37.410000  37.490002  36.209999  36.209999  32.432064  10067400
 2010-01-26  35.730000  36.990002  35.590000  36.340000  32.548504   8054000
 2010-01-27  36.360001  36.430000  35.270000  35.900002  32.154419  10387600
 2010-01-28  36.250000  36.459999  34.860001  35.680000  31.957380  10869200
 2010-01-29  35.639999  35.830002  33.889999  33.959999  30.416838  13424500
 2010-02-01  34.349998  35.610001  34.330002  35.540001  31.831987   8061800
 2010-02-02  36.000000  36.340000  35.439999  35.669998  31.948423   9966200
 2010-02-03  35.540001  36.169998  35.080002  35.160000  31.491642   7207200
 2010-02-04  34.490002  34.490002  33.080002  33.220001  29.754044  14658600
 2010-02-05  33.240002  35.580002  32.840000  35.509998  31.805090  18027000
 2010-02-08  35.480000  35.919998  34.320000  34.410000  30.819880  12511400
 2010-02-09  35.290001  36.500000  35.099998  35.889999  32.159489  14053700
 2010-02-10  35.869999  36.270000  35.099998  35.959999  32.222202   8741400
 2010-02-11  36.099998  37.520000  35.849998  37.439999  33.548367  10523400
 2010-02-12  36.709999  37.389999  36.380001  37.169998  33.306438   8320900
 2010-02-16  38.500000  38.799999  37.840000  38.330002  34.345856  10323000
 ...               ...        ...        ...        ...        ...       ...
 2017-07-24  13.700000  13.780000  13.420000  13.430000  13.430000   6955100
 2017-07-25  13.490000  13.620000  13.350000  13.420000  13.420000   7318500
 2017-07-26  13.370000  13.880000  13.350000  13.790000  13.790000  11945400
 2017-07-27  13.920000  13.940000  12.790000  12.810000  12.810000  20094100
 2017-07-28  12.950000  13.130000  12.880000  13.050000  13.050000   8514800
 2017-07-31  13.030000  13.280000  12.980000  13.130000  13.130000   9106000
 2017-08-01  13.090000  13.190000  12.880000  13.070000  13.070000   6787900
 2017-08-02  12.990000  13.100000  12.950000  12.960000  12.960000   5780500
 2017-08-03  12.950000  13.020000  12.780000  12.810000  12.810000   6331000
 2017-08-04  12.750000  12.770000  12.460000  12.560000  12.560000   8834400
 2017-08-07  12.680000  12.740000  12.520000  12.560000  12.560000   4636500
 2017-08-08  12.750000  12.780000  12.490000  12.550000  12.550000   7262700
 2017-08-09  12.770000  12.800000  12.600000  12.720000  12.720000   9055100
 2017-08-10  12.960000  13.040000  12.780000  13.030000  13.030000   9149800
 2017-08-11  13.100000  13.150000  12.880000  13.000000  13.000000   7464600
 2017-08-14  12.870000  12.900000  12.720000  12.830000  12.830000   4664600
 2017-08-15  12.630000  12.750000  12.610000  12.730000  12.730000   4377900
 2017-08-16  12.740000  13.120000  12.690000  13.030000  13.030000   7515500
 2017-08-17  13.130000  13.190000  13.030000  13.170000  13.170000   6979700
 2017-08-18  13.380000  13.390000  12.850000  12.870000  12.870000   8731800
 2017-08-21  12.910000  13.040000  12.880000  13.010000  13.010000   6321400
 2017-08-22  12.980000  13.030000  12.900000  12.910000  12.910000   4771600
 2017-08-23  13.000000  13.030000  12.870000  13.020000  13.020000   3914700
 2017-08-24  13.000000  13.090000  12.960000  13.010000  13.010000   3616300
 2017-08-25  13.040000  13.210000  12.970000  13.070000  13.070000   4844800
 2017-08-28  13.230000  13.500000  13.110000  13.490000  13.490000   8437700
 2017-08-29  13.790000  13.790000  13.480000  13.590000  13.590000   8842600
 2017-08-30  13.530000  13.560000  13.320000  13.380000  13.380000   4966600
 2017-08-31  13.440000  13.780000  13.350000  13.750000  13.750000   8198000
 2017-09-01  13.820000  13.820000  13.620000  13.750000  13.750000   4825400

 [1931 rows x 6 columns],
 'IBM':                   Open        High         Low       Close   Adj Close  \
 Date
 2010-01-04  131.179993  132.970001  130.850006  132.449997  109.173752
 2010-01-05  131.679993  131.850006  130.100006  130.850006  107.854950
 2010-01-06  130.679993  131.490005  129.809998  130.000000  107.154320
 2010-01-07  129.869995  130.250000  128.910004  129.550003  106.783417
 2010-01-08  129.070007  130.919998  129.050003  130.850006  107.854950
 2010-01-11  131.059998  131.059998  128.669998  129.479996  106.725700
 2010-01-12  129.029999  131.330002  129.000000  130.509995  107.574692
 2010-01-13  130.389999  131.119995  129.160004  130.229996  107.343887
 2010-01-14  130.550003  132.710007  129.910004  132.309998  109.058350
 2010-01-15  132.029999  132.889999  131.089996  131.779999  108.621490
 2010-01-19  131.630005  134.250000  131.559998  134.139999  110.566757
 2010-01-20  130.460007  131.149994  128.949997  130.250000  107.360382
 2010-01-21  130.470001  130.690002  128.059998  129.000000  106.330040
 2010-01-22  128.669998  128.889999  125.370003  125.500000  103.445122
 2010-01-25  126.330002  126.889999  125.709999  126.120003  103.956169
 2010-01-26  125.919998  127.750000  125.410004  125.750000  103.651207
 2010-01-27  125.820000  126.959999  125.040001  126.330002  104.129272
 2010-01-28  127.029999  127.040001  123.050003  123.750000  102.002670
 2010-01-29  124.320000  125.000000  121.900002  122.389999  100.881660
 2010-02-01  123.230003  124.949997  122.779999  124.669998  102.760971
 2010-02-02  124.790001  125.809998  123.949997  125.529999  103.469849
 2010-02-03  125.160004  126.070000  125.070000  125.660004  103.577019
 2010-02-04  125.190002  125.440002  122.900002  123.000000  101.384453
 2010-02-05  123.040001  123.720001  121.830002  123.519997  101.813095
 2010-02-08  123.150002  123.220001  121.739998  121.879997  100.910622
 2010-02-09  122.650002  124.199997  122.459999  123.209999  102.011803
 2010-02-10  122.940002  123.650002  122.209999  122.809998  101.680611
 2010-02-11  122.580002  124.199997  122.059998  123.730003  102.442314
 2010-02-12  123.010002  124.050003  121.610001  124.000000  102.665886
 2010-02-16  124.910004  125.230003  124.110001  125.230003  103.684265
 ...                ...         ...         ...         ...         ...
 2017-07-24  147.000000  147.039993  145.800003  145.990005  144.463654
 2017-07-25  146.570007  147.490005  146.029999  146.190002  144.661560
 2017-07-26  146.270004  146.460007  144.470001  145.360001  143.840240
 2017-07-27  145.000000  145.399994  143.639999  145.070007  143.553284
 2017-07-28  144.809998  145.039993  143.839996  144.289993  142.781418
 2017-07-31  144.380005  144.929993  144.169998  144.669998  143.157455
 2017-08-01  145.000000  145.669998  144.720001  145.300003  143.780869
 2017-08-02  145.119995  145.289993  144.220001  144.449997  142.939758
 2017-08-03  144.429993  145.339996  144.429993  144.940002  143.424637
 2017-08-04  145.000000  145.389999  144.399994  145.160004  143.642334
 2017-08-07  145.000000  145.089996  142.750000  143.470001  141.970001
 2017-08-08  142.000000  142.759995  142.000000  142.110001  142.110001
 2017-08-09  141.750000  142.029999  141.190002  141.770004  141.770004
 2017-08-10  141.639999  142.419998  141.229996  141.839996  141.839996
 2017-08-11  142.449997  142.589996  141.520004  141.839996  141.839996
 2017-08-14  142.000000  142.759995  141.940002  142.320007  142.320007
 2017-08-15  142.550003  143.339996  140.580002  142.070007  142.070007
 2017-08-16  141.789993  142.910004  141.610001  142.500000  142.500000
 2017-08-17  142.520004  142.889999  140.699997  140.699997  140.699997
 2017-08-18  140.869995  141.149994  139.580002  139.699997  139.699997
 2017-08-21  139.589996  140.419998  139.130005  140.330002  140.330002
 2017-08-22  140.639999  141.149994  140.380005  141.009995  141.009995
 2017-08-23  140.699997  143.050003  140.679993  142.139999  142.139999
 2017-08-24  142.500000  143.679993  142.250000  142.940002  142.940002
 2017-08-25  143.300003  144.190002  143.250000  143.740005  143.740005
 2017-08-28  144.110001  144.559998  142.389999  142.509995  142.509995
 2017-08-29  142.100006  143.429993  141.899994  143.139999  143.139999
 2017-08-30  143.259995  143.279999  142.410004  142.559998  142.559998
 2017-08-31  143.020004  143.660004  142.630005  143.029999  143.029999
 2017-09-01  142.979996  144.500000  142.979996  144.080002  144.080002

               Volume
 Date
 2010-01-04   6155300
 2010-01-05   6841400
 2010-01-06   5605300
 2010-01-07   5840600
 2010-01-08   4197200
 2010-01-11   5730400
 2010-01-12   8081500
 2010-01-13   6455400
 2010-01-14   7111800
 2010-01-15   8494400
 2010-01-19  13916200
 2010-01-20  15197500
 2010-01-21   9608600
 2010-01-22  10088600
 2010-01-25   5738500
 2010-01-26   7135300
 2010-01-27   8719200
 2010-01-28   9622200
 2010-01-29  11571200
 2010-02-01   7242900
 2010-02-02   5899900
 2010-02-03   4177100
 2010-02-04   9126900
 2010-02-05   8617000
 2010-02-08   5718500
 2010-02-09   6044500
 2010-02-10   5219100
 2010-02-11   5089000
 2010-02-12   8017700
 2010-02-16   6777300
 ...              ...
 2017-07-24   3877600
 2017-07-25   4208900
 2017-07-26   3932400
 2017-07-27   6430800
 2017-07-28   3054800
 2017-07-31   4355700
 2017-08-01   3219500
 2017-08-02   3540900
 2017-08-03   3035400
 2017-08-04   2549400
 2017-08-07   4618300
 2017-08-08   3298700
 2017-08-09   2925800
 2017-08-10   4525400
 2017-08-11   3004000
 2017-08-14   2222300
 2017-08-15   4681500
 2017-08-16   3287800
 2017-08-17   4422100
 2017-08-18   4152700
 2017-08-21   3190700
 2017-08-22   2544400
 2017-08-23   4048300
 2017-08-24   3592200
 2017-08-25   2872900
 2017-08-28   5134500
 2017-08-29   3009500
 2017-08-30   2736000
 2017-08-31   3656400
 2017-09-01   3348500

 [1931 rows x 6 columns],
 'MSFT':                  Open       High        Low      Close  Adj Close     Volume
 Date
 2010-01-04  30.620001  31.100000  30.590000  30.950001  25.275177   38409100
 2010-01-05  30.850000  31.100000  30.639999  30.959999  25.283342   49749600
 2010-01-06  30.879999  31.080000  30.520000  30.770000  25.128178   58182400
 2010-01-07  30.629999  30.700001  30.190001  30.450001  24.866852   50559700
 2010-01-08  30.280001  30.879999  30.240000  30.660000  25.038349   51197400
 2010-01-11  30.709999  30.760000  30.120001  30.270000  24.719858   68754700
 2010-01-12  30.150000  30.400000  29.910000  30.070000  24.556530   65912100
 2010-01-13  30.260000  30.520000  30.010000  30.350000  24.785191   51863500
 2010-01-14  30.309999  31.100000  30.260000  30.959999  25.283342   63228100
 2010-01-15  31.080000  31.240000  30.709999  30.860001  25.201679   79913200
 2010-01-19  30.750000  31.240000  30.680000  31.100000  25.397671   46575700
 2010-01-20  30.809999  30.940001  30.309999  30.590000  24.981182   54849500
 2010-01-21  30.610001  30.719999  30.000000  30.010000  24.507528   73086700
 2010-01-22  30.000000  30.200001  28.840000  28.959999  23.650047  102004600
 2010-01-25  29.240000  29.660000  29.100000  29.320000  23.944042   63373000
 2010-01-26  29.200001  29.850000  29.090000  29.500000  24.091042   66639900
 2010-01-27  29.350000  29.820000  29.020000  29.670000  24.229874   63949500
 2010-01-28  29.840000  29.870001  28.889999  29.160000  23.813379  117513700
 2010-01-29  29.900000  29.920000  27.660000  28.180000  23.013071  193888500
 2010-02-01  28.389999  28.480000  27.920000  28.410000  23.200891   85931100
 2010-02-02  28.370001  28.500000  28.139999  28.459999  23.241730   54413700
 2010-02-03  28.260000  28.790001  28.120001  28.629999  23.380560   61397900
 2010-02-04  28.379999  28.500000  27.809999  27.840000  22.735409   77850000
 2010-02-05  28.000000  28.280001  27.570000  28.020000  22.882408   80960100
 2010-02-08  28.010000  28.080000  27.570000  27.719999  22.637409   52820600
 2010-02-09  27.969999  28.340000  27.750000  28.010000  22.874241   59195800
 2010-02-10  28.030001  28.240000  27.840000  27.990000  22.857906   48591300
 2010-02-11  27.930000  28.400000  27.700001  28.120001  22.964071   65993700
 2010-02-12  27.809999  28.059999  27.580000  27.930000  22.808908   81117200
 2010-02-16  28.129999  28.370001  28.020000  28.350000  23.260166   51935600
 ...               ...        ...        ...        ...        ...        ...
 2017-07-24  73.529999  73.750000  73.129997  73.599998  73.209946   21394800
 2017-07-25  73.800003  74.309998  73.500000  74.190002  73.796822   22018700
 2017-07-26  74.339996  74.379997  73.809998  74.050003  73.657562   16252200
 2017-07-27  73.760002  74.419998  72.320000  73.160004  72.772285   36844200
 2017-07-28  72.669998  73.309998  72.540001  73.040001  72.652916   18306700
 2017-07-31  73.300003  73.440002  72.410004  72.699997  72.314713   23600100
 2017-08-01  73.099998  73.419998  72.489998  72.580002  72.195358   22132300
 2017-08-02  72.550003  72.559998  71.440002  72.260002  71.877052   26499200
 2017-08-03  72.190002  72.440002  71.849998  72.150002  71.767632   18214400
 2017-08-04  72.400002  73.040001  72.239998  72.680000  72.294823   22579000
 2017-08-07  72.800003  72.900002  72.260002  72.400002  72.016312   18705700

In [83]:
price = DataFrame({tic: data['Adj Close']
                  for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                  for tic, data in all_data.items()})

In [84]:
returns = price.pct_change()
returns.tail()

                AAPL        GG       IBM      MSFT
Date
2017-08-28  0.010071  0.032135 -0.008557  0.000137
2017-08-29  0.008918  0.007413  0.004421  0.003021
2017-08-30  0.002701 -0.015453 -0.004052  0.013142
2017-08-31  0.003979  0.027653  0.003297  0.010269
2017-09-01  0.000305  0.000000  0.007341 -0.011101

In [85]:
returns.MSFT.corr(returns.IBM)

0.48300904568365077

In [86]:
returns.MSFT.cov(returns.IBM)

8.0518452845229066e-05

In [87]:
returns.corr() # 상관계수

          AAPL        GG       IBM      MSFT
AAPL  1.000000  0.119241  0.367990  0.394345
GG    0.119241  1.000000  0.122215  0.108370
IBM   0.367990  0.122215  1.000000  0.483009
MSFT  0.394345  0.108370  0.483009  1.000000

In [89]:
returns.cov() # 공분산

          AAPL        GG       IBM      MSFT
AAPL  0.000259  0.000049  0.000070  0.000090
GG    0.000049  0.000663  0.000037  0.000039
IBM   0.000070  0.000037  0.000139  0.000081
MSFT  0.000090  0.000039  0.000081  0.000200

In [93]:
type(returns.corrwith(returns.IBM))

pandas.core.series.Series

In [94]:
returns.corrwith(returns.IBM)

AAPL    0.367990
GG      0.122215
IBM     1.000000
MSFT    0.483009
dtype: float64

In [91]:
returns.corrwith(volume) # 회사와 자기회사 주식 거래량과의 비교를 나타낸 거다!!!

AAPL   -0.072689
GG     -0.036458
IBM    -0.210648
MSFT   -0.090433
dtype: float64

### Unique values, value counts, and membership

In [95]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [96]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [97]:
obj.value_counts() # 도수구하기!

a    3
c    3
b    2
d    1
dtype: int64

In [98]:
pd.value_counts(obj.values, sort=False)

c    3
b    2
a    3
d    1
dtype: int64

In [99]:
mask = obj.isin(['b', 'c']) # 있느냐!
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [101]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [102]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [104]:
result = data.apply(pd.value_counts).fillna(0) # counting을 하네!! 
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [105]:
result2 = data.apply(pd.value_counts) # counting을 하네!! 
result2

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

## Handling missing data, 결측값 처리

In [106]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [107]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [109]:
string_data[0] = None 
string_data.isnull()# isnull에 None과 NaN 다 적용된다.
string_data

0     True
1    False
2     True
3    False
dtype: bool

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

### Filtering out missing data

In [110]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [112]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [111]:
data[data.notnull()] #dropna() 와 같네!

0    1.0
2    3.5
4    7.0
dtype: float64

In [114]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna() # Null 값이 하나도 없는 ROW만 보여주네!!
cleaned
data

     0    1    2
0  1.0  6.5  3.0

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [116]:
data.dropna(how='all') # how setting 할 수 있다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [117]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [119]:
data.dropna(axis=1, how='all') # 열을 기준으로 모두 Null 인 열을 지우겠다.
                               # 2차원 1번축 열이지!

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [121]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA # 이경우 ix는 label인지 index 인지 햇갈리게 된다.
                                     # 우선시 되는 것인 label이다!
df

          0         1         2
0 -0.525894       NaN       NaN
1 -1.262864       NaN       NaN
2 -1.653616       NaN       NaN
3 -0.242717       NaN -0.344329
4 -0.161004       NaN -0.450325
5 -2.313431 -0.928520 -0.187675
6  0.469671 -0.228314  0.773324

In [124]:
df = DataFrame(np.random.randn(7, 3))
df.loc[:4, 1] = NA; df.loc[:2, 2] = NA # label로 처리한거임
df

          0         1         2
0  0.245826       NaN       NaN
1  0.481968       NaN       NaN
2 -0.054750       NaN       NaN
3  0.043249       NaN  1.210330
4  0.747227       NaN  1.123374
5  0.707579  0.063445  1.984141
6 -0.153355  0.585285  2.769300

In [126]:
df = DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA; df.iloc[:2, 2] = NA # index는 뒷값 포함 안하지!!
df

          0         1         2
0  0.735538       NaN       NaN
1  1.505416       NaN       NaN
2 -2.009002       NaN -0.755746
3  1.807734       NaN  0.345473
4  1.510918 -0.465625 -0.971495
5 -0.884288  0.857839 -0.787744
6 -0.491886 -0.151953  1.433525

In [129]:
df.dropna(thresh=2) # thresh는 문턱값이다!! notNull 인 값 2개 이사인 행을 뽑아라!!
                    # axix=0 default지

          0         1         2
2 -2.009002       NaN -0.755746
3  1.807734       NaN  0.345473
4  1.510918 -0.465625 -0.971495
5 -0.884288  0.857839 -0.787744
6 -0.491886 -0.151953  1.433525

### Filling in missing data

In [130]:
df.fillna(0)

          0         1         2
0  0.735538  0.000000  0.000000
1  1.505416  0.000000  0.000000
2 -2.009002  0.000000 -0.755746
3  1.807734  0.000000  0.345473
4  1.510918 -0.465625 -0.971495
5 -0.884288  0.857839 -0.787744
6 -0.491886 -0.151953  1.433525

In [132]:
df.fillna({1: 0.5, 3: -1}) # 3번 컬럼은 없어서 적용 안된거임!!
                           # 사전을 붙였네!

          0         1         2
0  0.735538  0.500000       NaN
1  1.505416  0.500000       NaN
2 -2.009002  0.500000 -0.755746
3  1.807734  0.500000  0.345473
4  1.510918 -0.465625 -0.971495
5 -0.884288  0.857839 -0.787744
6 -0.491886 -0.151953  1.433525

In [133]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True) # 데이터에 직접 적용하겠다는 뜻이다. inplace!
                               # df에 직접 적용하겠다!!
df

          0         1         2
0  0.735538  0.000000  0.000000
1  1.505416  0.000000  0.000000
2 -2.009002  0.000000 -0.755746
3  1.807734  0.000000  0.345473
4  1.510918 -0.465625 -0.971495
5 -0.884288  0.857839 -0.787744
6 -0.491886 -0.151953  1.433525

In [134]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

          0        1         2
0  0.664654 -0.42104  0.358633
1 -0.548873 -0.38227 -1.618206
2 -0.574885      NaN  1.716201
3 -2.026796      NaN -1.262458
4 -0.189224      NaN       NaN
5  0.551440      NaN       NaN

In [135]:
df.fillna(method='ffill') # forward fill

          0        1         2
0  0.664654 -0.42104  0.358633
1 -0.548873 -0.38227 -1.618206
2 -0.574885 -0.38227  1.716201
3 -2.026796 -0.38227 -1.262458
4 -0.189224 -0.38227 -1.262458
5  0.551440 -0.38227 -1.262458

In [140]:
df.fillna(method='ffill', limit=2) # 제한을 걸어둠!!

          0        1         2
0  0.664654 -0.42104  0.358633
1 -0.548873 -0.38227 -1.618206
2 -0.574885 -0.38227  1.716201
3 -2.026796 -0.38227 -1.262458
4 -0.189224      NaN -1.262458
5  0.551440      NaN -1.262458

In [139]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean()) # 전체 평균을 적용시켜주네!!
data

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [142]:
df.fillna(df.mean()) # 열 평균이다!!

          0         1         2
0  0.664654 -0.421040  0.358633
1 -0.548873 -0.382270 -1.618206
2 -0.574885 -0.401655  1.716201
3 -2.026796 -0.401655 -1.262458
4 -0.189224 -0.401655 -0.201457
5  0.551440 -0.401655 -0.201457

In [165]:
df.fillna(df.mean(axis=1)) # 행평균인데 윗 row의 평균이네 왜?!?!

          0         1         2
0  0.664654 -0.421040  0.358633
1 -0.548873 -0.382270 -1.618206
2 -0.574885 -0.849783  1.716201
3 -2.026796 -0.849783 -1.262458
4 -0.189224 -0.849783  0.570658
5  0.551440 -0.849783  0.570658

## Hierarchical indexing 계층 인덱싱!

In [143]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.071684
   2   -0.619063
   3    1.276917
b  1    0.854740
   2   -0.682261
   3   -0.036429
c  1   -0.488380
   2    0.594320
d  2    0.772481
   3   -0.585446
dtype: float64

In [144]:
data.index # 계층적 index는 멀티index이다!!

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [147]:
data['b']

1    0.854740
2   -0.682261
3   -0.036429
dtype: float64

In [148]:
data['b':'c']

b  1    0.854740
   2   -0.682261
   3   -0.036429
c  1   -0.488380
   2    0.594320
dtype: float64

In [151]:
data.ix[['b', 'd']] # list를 넣어준거지!!!

b  1    0.854740
   2   -0.682261
   3   -0.036429
d  2    0.772481
   3   -0.585446
dtype: float64

In [158]:
data[:, 2] # :(상위 인덱스 전체) , 2(하위 인덱스 2번만!)!!

a   -0.619063
b   -0.682261
c    0.594320
d    0.772481
dtype: float64

In [161]:
data.unstack() # series, dataframe 모두에 적용 할 수 있다!! 
               # pivoting이네!

          1         2         3
a  0.071684 -0.619063  1.276917
b  0.854740 -0.682261 -0.036429
c -0.488380  0.594320       NaN
d       NaN  0.772481 -0.585446

In [172]:
data.unstack().stack()

a  1    0.071684
   2   -0.619063
   3    1.276917
b  1    0.854740
   2   -0.682261
   3   -0.036429
c  1   -0.488380
   2    0.594320
d  2    0.772481
   3   -0.585446
dtype: float64

In [177]:
data.unstack(level=0) # level은 몇번째 계층 index를 열로 할 것인가?!
                      # level 기본값은 -1이다. 여기서는 1 == -1 이지!

          a         b        c         d
1  0.071684  0.854740 -0.48838       NaN
2 -0.619063 -0.682261  0.59432  0.772481
3  1.276917 -0.036429      NaN -0.585446

In [178]:
s = Series([3,8,2,0,3,5], index=list('abcdef')); s

a    3
b    8
c    2
d    0
e    3
f    5
dtype: int64

In [181]:
Series.unstack? # Series는 unstack 없네.

SyntaxError: invalid syntax (<ipython-input-181-cc430e8134f5>, line 1)

In [180]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [183]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [184]:
frame['Ohio'] # select 함! column

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

### Reordering and sorting levels

In [186]:
frame.swaplevel('key1', 'key2') # level을 swap 했네!!

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [189]:
# frame.sortlevel(axis = 1)
frame.sort_index(1) # axis = 1은 key2를 이야기 하는 거다!!

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [194]:
frame.swaplevel(0, 1).sort_index(1)
frame.swaplevel(0, 1).sort_index(0)

state     Colorado  Ohio
color        Green Green Red
key2 key1
1    a           2     0   1
2    a           5     3   4
1    b           8     6   7
2    b          11     9  10

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [195]:
frame.sum(level='key2') # key2에 대해서 sum을 구한다!!

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [197]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [ ]:
frame.sum(level='key2', axis=1) # 계산하려는 축과 이름이 맞지 않으면 에러발생하지!!

### Using a DataFrame's columns

In [200]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [205]:
frame2 = frame.set_index(['c', 'd'])
frame2
frame2.unstack().unstack()

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

   d  c
a  0  one    0.0
      two    3.0
   1  one    1.0
      two    4.0
   2  one    2.0
      two    5.0
   3  one    NaN
      two    6.0
b  0  one    7.0
      two    4.0
   1  one    6.0
      two    3.0
   2  one    5.0
      two    2.0
   3  one    NaN
      two    1.0
dtype: float64

In [207]:
frame.set_index(['c', 'd'], drop=False) # index로 지정해도 버리지 않음!

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [210]:
frame2
frame2.reset_index() # 할당 지정해 줘야 저장해서 쓸 수 있지.
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

## Other pandas topics

### Integer indexing

In [218]:
ser = Series(np.arange(3.))
ser
ser.iloc[-1]
ser[2] # -1은 안된다. label을 찾기 때문에!!

0    0.0
1    1.0
2    2.0
dtype: float64

2.0

2.0

In [214]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2
ser2[-1] # -1이 되네.. label로 인식하지 않은 거다. 자연수가 아니어서,,

a    0.0
b    1.0
c    2.0
dtype: float64

2.0

In [223]:
ser.ix[:1] 
ser.loc[:1] # 둘다 label 인식이지.
ser2.loc[:'b']

0    0.0
1    1.0
dtype: float64

0    0.0
1    1.0
dtype: float64

a    0.0
b    1.0
dtype: float64

In [228]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3
ser3.iloc[2] # index로 추출하지!!
ser3.loc[-5]

-5    0
 1    1
 3    2
dtype: int32

2

0

In [236]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame
frame.iloc[0]
frame[0]
frame.iloc[2]

   0  1
2  0  1
0  2  3
1  4  5

0    0
1    1
Name: 2, dtype: int32

2    0
0    2
1    4
Name: 0, dtype: int32

0    4
1    5
Name: 1, dtype: int32

### Panel data

In [245]:
# import pandas.io.data as web
import pandas_datareader as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'IBM']))

In [253]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1931 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2017-09-01 00:00:00
Minor_axis axis: Open to Volume

In [268]:
pdata = pdata.swapaxes('items', 'minor') # 축을 맞바꿈!!
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1931 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2017-09-01 00:00:00
Minor_axis axis: Open to Volume

In [257]:
pdata['Adj Close'] # 수정종가!

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.505054  312.204773  109.173752  25.275177
2010-01-05   27.552608  310.829926  107.854950  25.283342
2010-01-06   27.114347  302.994293  107.154320  25.128178
2010-01-07   27.064222  295.940735  106.783417  24.866852
2010-01-08   27.244156  299.885956  107.854950  25.038349
2010-01-11   27.003820  299.432648  106.725700  24.719858
2010-01-12   26.696650  294.137512  107.574692  24.556530
2010-01-13   27.073221  292.448822  107.343887  24.785191
2010-01-14   26.916422  293.823669  109.058350  25.283342
2010-01-15   26.466595  288.917053  108.621490  25.201679
2010-01-19   27.637430  292.712830  110.566757  25.397671
2010-01-20   27.212029  289.121307  107.360382  24.981182
2010-01-21   26.741631  290.401489  106.330040  24.507528
2010-01-22   25.415281  273.978058  103.445122  23.650047
2010-01-25   26.099028  268.991760  103.956169  23.944042
2010-01-26   26.467880  270.197235  103.651207  24.091042
2010-01-27   26.717218  270.037842  104.129272  24.229874
2010-01-28   25.613209  266.147400  102.002670  23.813379
2010-01-29   24.683992  263.980530  100.881660  23.013071
2010-02-01   25.027143  265.514771  102.760971  23.200891
2010-02-02   25.172379  264.568329  103.469849  23.241730
2010-02-03   25.605494  269.400208  103.577019  23.380560
2010-02-04   24.682707  262.406433  101.384453  22.735409
2010-02-05   25.120964  264.653015  101.813095  22.882408
2010-02-08   24.948748  265.738953  100.910622  22.637409
2010-02-09   25.214790  267.218414  102.011803  22.874241
2010-02-10   25.077271  266.227112  101.680611  22.857906
2010-02-11   25.533520  267.198486  102.442314  22.964071
2010-02-12   25.753294  265.564606  102.665886  22.808908
2010-02-16   26.141434  269.639313  103.684265  23.260166
...                ...         ...         ...        ...
2017-07-24  151.495071  980.340027  144.463654  73.209946
2017-07-25  152.142548  950.700012  144.661560  73.796822
2017-07-26  152.859726  947.799988  143.840240  73.657562
2017-07-27  149.971069  934.090027  143.553284  72.772285
2017-07-28  148.915207  941.530029  142.781418  72.652916
2017-07-31  148.148224  930.500000  143.157455  72.314713
2017-08-01  149.463058  930.830017  143.780869  72.195358
2017-08-02  156.525330  930.390015  142.939758  71.877052
2017-08-03  154.961472  923.650024  143.424637  71.767632
2017-08-04  155.778259  927.960022  143.642334  72.294823
2017-08-07  158.188797  929.359985  141.970001  72.016312
2017-08-08  159.453827  926.789978  142.110001  72.404243
2017-08-09  160.429993  922.900024  141.770004  72.085938
2017-08-10  155.320007  907.239990  141.839996  71.031555
2017-08-11  157.479996  914.390015  141.839996  72.115776
2017-08-14  159.850006  922.669983  142.320007  73.199997
2017-08-15  161.600006  922.219971  142.070007  73.220001
2017-08-16  160.949997  926.960022  142.500000  73.650002
2017-08-17  157.860001  910.979980  140.699997  72.400002
2017-08-18  157.500000  910.669983  139.699997  72.489998
2017-08-21  157.210007  906.659973  140.330002  72.150002
2017-08-22  159.779999  924.690002  141.009995  73.160004
2017-08-23  159.979996  927.000000  142.139999  72.720001
2017-08-24  159.270004  921.280029  142.940002  72.690002
2017-08-25  159.860001  915.890015  143.740005  72.820000
2017-08-28  161.470001  913.809998  142.509995  72.830002
2017-08-29  162.910004  921.289978  143.139999  73.050003
2017-08-30  163.350006  929.570007  142.559998  74.010002
2017-08-31  164.000000  939.330017  143.029999  74.769997
2017-09-01  164.050003  937.340027  144.080002  73.940002

[1931 rows x 4 columns]

In [259]:
pdata.ix[:, '6/1/2012', :] # 12년 1월 6일 데이터를 봄!! 표(항목) 행(날짜) 열(회사)

            Open        High         Low       Close   Adj Close       Volume
AAPL   81.308571   81.807144   80.074287   80.141426   72.099739  130246900.0
GOOG  284.827393  285.255798  283.113831  284.423920  284.423920    6138700.0
IBM   190.119995  191.720001  188.600006  189.080002  162.828171    5206400.0
MSFT   28.760000   28.959999   28.440001   28.450001   24.668653   56634300.0

In [263]:
pdata.loc['Adj Close', '5/22/2012':, :]

                  AAPL        GOOG         IBM       MSFT
Date
2012-05-22   71.583061  299.278229  169.493561  25.804539
2012-05-23   73.329674  303.592072  168.890732  25.240936
2012-05-24   72.656212  300.702881  168.864868  25.206251
2012-05-25   72.266800  294.660553  167.323425  25.197577
2012-05-29   73.549454  296.060303  169.183533  25.631123
2012-05-30   74.436249  293.016693  167.521484  25.440367
2012-05-31   74.251175  289.345459  166.117752  25.310303
2012-06-01   72.099739  284.423920  162.828171  24.668653
2012-06-04   72.523842  288.214691  162.363113  24.755363
2012-06-05   72.336205  284.139984  162.931534  24.720682
2012-06-06   73.445358  289.200989  167.056473  25.449030
2012-06-07   73.478767  288.035370  167.443970  25.344986
2012-06-08   74.584061  289.141235  168.046753  25.709158
2012-06-11   73.408081  283.188538  165.781921  25.058844
2012-06-12   74.049400  281.494873  167.538712  25.397011
2012-06-13   73.535316  279.497375  166.290054  25.258274
2012-06-14   73.454330  278.481171  168.012360  25.440367
2012-06-15   73.788521  281.200989  171.457001  26.029984
2012-06-18   75.285774  284.359161  170.759460  25.873913
2012-06-19   75.495277  289.679199  171.310577  26.619606
2012-06-20   75.280624  287.676727  171.181396  26.819031
2012-06-21   74.243469  281.549683  166.539749  26.134035
2012-06-22   74.812836  284.672974  166.806732  26.619606
2012-06-25   73.356667  279.303101  166.083328  25.899921
2012-06-26   73.518631  281.285675  165.299698  26.029984
2012-06-27   73.836052  283.587036  166.203903  26.160044
2012-06-28   73.135612  281.101349  164.826035  25.934605
2012-06-29   75.057014  288.951935  168.425720  26.524225
2012-07-02   76.152031  289.151184  168.640976  26.498209
2012-07-03   77.037544  292.817444  168.727112  26.671631
...                ...         ...         ...        ...
2017-07-24  151.495071  980.340027  144.463654  73.209946
2017-07-25  152.142548  950.700012  144.661560  73.796822
2017-07-26  152.859726  947.799988  143.840240  73.657562
2017-07-27  149.971069  934.090027  143.553284  72.772285
2017-07-28  148.915207  941.530029  142.781418  72.652916
2017-07-31  148.148224  930.500000  143.157455  72.314713
2017-08-01  149.463058  930.830017  143.780869  72.195358
2017-08-02  156.525330  930.390015  142.939758  71.877052
2017-08-03  154.961472  923.650024  143.424637  71.767632
2017-08-04  155.778259  927.960022  143.642334  72.294823
2017-08-07  158.188797  929.359985  141.970001  72.016312
2017-08-08  159.453827  926.789978  142.110001  72.404243
2017-08-09  160.429993  922.900024  141.770004  72.085938
2017-08-10  155.320007  907.239990  141.839996  71.031555
2017-08-11  157.479996  914.390015  141.839996  72.115776
2017-08-14  159.850006  922.669983  142.320007  73.199997
2017-08-15  161.600006  922.219971  142.070007  73.220001
2017-08-16  160.949997  926.960022  142.500000  73.650002
2017-08-17  157.860001  910.979980  140.699997  72.400002
2017-08-18  157.500000  910.669983  139.699997  72.489998
2017-08-21  157.210007  906.659973  140.330002  72.150002
2017-08-22  159.779999  924.690002  141.009995  73.160004
2017-08-23  159.979996  927.000000  142.139999  72.720001
2017-08-24  159.270004  921.280029  142.940002  72.690002
2017-08-25  159.860001  915.890015  143.740005  72.820000
2017-08-28  161.470001  913.809998  142.509995  72.830002
2017-08-29  162.910004  921.289978  143.139999  73.050003
2017-08-30  163.350006  929.570007  142.559998  74.010002
2017-08-31  164.000000  939.330017  143.029999  74.769997
2017-09-01  164.050003  937.340027  144.080002  73.940002

[1330 rows x 4 columns]

In [270]:
stacked = pdata.loc[:, '5/30/2012':, :].to_frame()
stacked
# 3차원 데이터를 계층적 index를 통해서 표현하고 있다!!

                              AAPL          GOOG           IBM          MSFT
Date       minor
2012-05-30 Open       8.131428e+01  2.929818e+02  1.948000e+02  2.935000e+01
           High       8.285571e+01  2.948448e+02  1.954700e+02  2.948000e+01
           Low        8.093714e+01  2.906755e+02  1.937700e+02  2.912000e+01
           Close      8.273857e+01  2.930167e+02  1.945300e+02  2.934000e+01
           Adj Close  7.443625e+01  2.930167e+02  1.675215e+02  2.544037e+01
           Volume     1.323574e+08  3.827600e+06  3.602500e+06  4.158550e+07
2012-05-31 Open       8.296286e+01  2.932608e+02  1.941000e+02  2.930000e+01
           High       8.307143e+01  2.938984e+02  1.949300e+02  2.942000e+01
           Low        8.163715e+01  2.884189e+02  1.920000e+02  2.894000e+01
           Close      8.253286e+01  2.893455e+02  1.929000e+02  2.919000e+01
           Adj Close  7.425118e+01  2.893455e+02  1.661178e+02  2.531030e+01
           Volume     1.229186e+08  5.958800e+06  9.287500e+06  3.913400e+07
2012-06-01 Open       8.130857e+01  2.848274e+02  1.901200e+02  2.876000e+01
           High       8.180714e+01  2.852558e+02  1.917200e+02  2.896000e+01
           Low        8.007429e+01  2.831138e+02  1.886000e+02  2.844000e+01
           Close      8.014143e+01  2.844239e+02  1.890800e+02  2.845000e+01
           Adj Close  7.209974e+01  2.844239e+02  1.628282e+02  2.466865e+01
           Volume     1.302469e+08  6.138700e+06  5.206400e+06  5.663430e+07
2012-06-04 Open       8.021429e+01  2.840453e+02  1.883400e+02  2.862000e+01
           High       8.107143e+01  2.891612e+02  1.893800e+02  2.878000e+01
           Low        7.835714e+01  2.839407e+02  1.870000e+02  2.832000e+01
           Close      8.061285e+01  2.882147e+02  1.885400e+02  2.855000e+01
           Adj Close  7.252384e+01  2.882147e+02  1.623631e+02  2.475536e+01
           Volume     1.392489e+08  4.883500e+06  4.624500e+06  4.792630e+07
2012-06-05 Open       8.018143e+01  2.866506e+02  1.879200e+02  2.851000e+01
           High       8.092429e+01  2.879856e+02  1.898500e+02  2.875000e+01
           Low        7.976143e+01  2.821773e+02  1.875600e+02  2.839000e+01
           Close      8.040429e+01  2.841400e+02  1.892000e+02  2.851000e+01
           Adj Close  7.233621e+01  2.841400e+02  1.629315e+02  2.472068e+01
           Volume     9.705360e+07  4.697200e+06  3.556500e+06  4.571540e+07
...                            ...           ...           ...           ...
2017-08-28 Open       1.601400e+02  9.160000e+02  1.441100e+02  7.306000e+01
           High       1.620000e+02  9.192450e+02  1.445600e+02  7.309000e+01
           Low        1.599300e+02  9.118700e+02  1.423900e+02  7.255000e+01
           Close      1.614700e+02  9.138100e+02  1.425100e+02  7.283000e+01
           Adj Close  1.614700e+02  9.138100e+02  1.425100e+02  7.283000e+01
           Volume     2.596600e+07  1.086500e+06  5.134500e+06  1.456970e+07
2017-08-29 Open       1.601000e+02  9.051000e+02  1.421000e+02  7.225000e+01
           High       1.631200e+02  9.233300e+02  1.434300e+02  7.316000e+01
           Low        1.600000e+02  9.050000e+02  1.419000e+02  7.205000e+01
           Close      1.629100e+02  9.212900e+02  1.431400e+02  7.305000e+01
           Adj Close  1.629100e+02  9.212900e+02  1.431400e+02  7.305000e+01
           Volume     2.951690e+07  1.185600e+06  3.009500e+06  1.147840e+07
2017-08-30 Open       1.638000e+02  9.200500e+02  1.432600e+02  7.301000e+01
           High       1.638900e+02  9.308190e+02  1.432800e+02  7.421000e+01
           Low        1.626100e+02  9.196500e+02  1.424100e+02  7.283000e+01
           Close      1.633500e+02  9.295700e+02  1.425600e+02  7.401000e+01
           Adj Close  1.633500e+02  9.295700e+02  1.425600e+02  7.401000e+01
           Volume     2.726960e+07  1.301200e+06  2.736000e+06  1.689780e+07
2017-08-31 Open       1.636400e+02  9.317600e+02  1.430200e+02  7.403000e+01
           High       1.645200e+02  9.419800e+02  1.436600e+02  7.496000e+01
           Low        1.634800e+02  9.317600e+02  1.426300e+02  7.380000e+01
           Close      1.640000e+02  9.393300e+02  1.430300e+02  7.477000e+01
           Adj Close  1.640000e+02  9.393300e+02  1.430300e+02  7.477000e+01
           Volume     2.678510e+07  1.582600e+06  3.656400e+06  2.765280e+07
2017-09-01 Open       1.648000e+02  9.411300e+02  1.429800e+02  7.471000e+01
           High       1.649400e+02  9.424800e+02  1.445000e+02  7.474000e+01
           Low        1.636300e+02  9.351500e+02  1.429800e+02  7.364000e+01
           Close      1.640500e+02  9.373400e+02  1.440800e+02  7.394000e+01
           Adj Close  1.640500e+02  9.373400e+02  1.440800e+02  7.394000e+01
           Volume     1.655280e+07  9.159000e+05  3.348500e+06  2.170620e+07

[7950 rows x 4 columns]

In [272]:
stacked.to_panel() # frame 데이터를 panel 데이터로 변환함!!
                   # 객체로만 보여준다!!

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1325 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2012-05-30 00:00:00 to 2017-09-01 00:00:00
Minor_axis axis: Open to Volume